{
  "label": "Offline Support (Progressive Web App) Settings",
  "name": "offlineSupportSettings",
  "file": "settings/offline/offline-settings.json",
  "fields": [
    {
      "label": "Offline Support (One-Click PWA)",
      "name": "offlineSupportEnabled",
      "widget": "boolean",
      "hint": "When switched on, your website will become a progressive web app (PWA) that can be installed on a user's device. The user will be prompted to install upon visiting the site. Once installed, an icon for the site will be added to the home screen, and the site will behave like a native app and can be used offline."
    },
    {
      "label": "Show Prompt When Update Available",
      "name": "showPromptWhenUpdateAvailable",
      "widget": "boolean",
      "hint": "When on, the user will be prompted when there are updates to your app."
    },
    {
      "label": "Update Prompt",
      "name": "updateAvailablePromptMessage",
      "widget": "string",
      "hint": "The prompt shown to the user when an update to your app is available. To test this, open your app on your phone, then make a change to the site. You should see the prompt to reload within a few minutes."
    },
    {
      "label": "Offline Support Options",
      "name": "gatsbyPluginManifestOptions",
      "widget": "object",
      "hint": "↑ Configure offline support.",
      "fields": [
        {
          "label": "Name",
          "name": "name",
          "widget": "string",
          "hint": "The name of your app. You can use {siteName} for the site name."
        },
        {
          "label": "Short Name",
          "name": "shortName",
          "widget": "string",
          "hint": "A concise name that fits in small screen areas. You can use {siteName} for the site name."
        },
        {
          "label": "Start URL",
          "name": "startUrl",
          "widget": "string",
          "hint": "The URL to start at. Typically this will be /"
        },
        {
          "label": "Theme Color",
          "name": "themeColor",
          "widget": "string",
          "hint": "Theme color for your app. Your app's title bar will use this color. Choose your app's primary color. For a quick color scheme, visit: https://coolors.co/"
        },
        {
          "label": "Background Color",
          "name": "backgroundColor",
          "widget": "string",
          "hint": "Background color for your app. Your app's icon may be shown over this background color while the app launches. For a quick color scheme, visit: https://coolors.co/"
        },
        {
          "label": "Display Type",
          "name": "display",
          "widget": "select",
          "hint": "⮞ Fullscreen: Opens the web application without any browser UI and takes up the entirety of the available display area. ⮞ Standalone: Opens the web app to look and feel like a standalone native app. The app runs in its own window, separate from the browser, and hides standard browser UI elements like the URL bar, etc. ⮞ Minimal UI: This mode is similar to fullscreen, but provides the user with some means to access a minimal set of UI elements for controlling navigation (i.e., back, forward, reload, etc). Note: Only supported by Chrome on mobile. ⮞ Browser: A standard browser experience.",
          "options": [
            {
              "label": "Fullscreen - No browser UI, takes up entire display.",
              "value": "fullscreen"
            },
            {
              "label": "Standalone (Recommended) - Looks and feels like a standalone native app.",
              "value": "standalone"
            },
            {
              "label": "Minimal UI - Similar to fullscreen with limited navigation. Mobile Chrome only.",
              "value": "minimal-ui"
            },
            {
              "label": "Browser - A standard browser experience.",
              "value": "browser"
            }
          ]
        },
        {
          "label": "Icon",
          "name": "icon",
          "widget": "object",
          "fields": [
            {
              "label": "Use Site Icon",
              "name": "useSiteIcon",
              "widget": "boolean",
              "hint": "Switch on to use the Site Icon (configured in Site Settings) as the app icon. When switched on, the Custom Icon below will be ignored."
            },
            {
              "label": "Custom Icon",
              "name": "customIcon",
              "widget": "image",
              "hint": "Specify a custom icon for your app. The Use Site Logo setting above must be switched off. Must be square, at least 512x512, and either: JPEG, PNG, WebP, TIFF, GIF or SVG."
            }
          ]
        }
      ]
    }
  ]
}